# Projeto de Bases de Dados - Parte 2

### Docente Respons√°vel

Prof. Fl√°vio Martins

### Grupo 55 - Turno BD2L19
<dl>
    <dt>4,5 horas (33.3%)</dt>
    <dd>ist103471 Jo√£o Fidalgo</dd>
    <dt>4,5 horas (33.3%)</dt>
    <dd>ist103938 Jos√© Lopes</dd>
    <dt>4,5 horas (33.3%)</dt>
    <dd>ist104139 Rodrigo Fri√£es</dd>
<dl>

# Empresa de com√©rcio online

## 1 Convers√£o E-A para Modelo Relacional

Recorde a nota√ß√£o para o Modelo Relacional exposta nas aulas te√≥ricas como se segue:

- relacaoA (<u>atributo1</u>, ‚Ä¶ , atributoN)
    - atributoX, ‚Ä¶ , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, ‚Ä¶ , AtributoC)
- relacaoB (<u>atributo1</u>, ‚Ä¶ , atributoN)
    - atributoX, ‚Ä¶ , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, ‚Ä¶ , AtributoC)

1. As rela√ß√µes s√£o expressas por um nome seguido dos atributos entre par√™ntesis;
    - As chave prim√°rias s√£o expressas sublinhando os atributos que a comp√µem;
    - As chaves estrangeiras para outras rela√ß√µes s√£o expressas atrav√©s da lista de atributos que a comp√µem, seguida de ‚Äú: FK(RelacaoDestino)‚Äù. A ordem dos atributos que comp√µem a FK deve corresponder √† ordem dos atributos da chave na rela√ß√£o destino;
    - As chaves candidatas s√£o expressas atrav√©s da express√£o ‚Äúunique‚Äù, seguida da lista de atributos que a comp√µem entre par√™ntesis;
    - As restri√ß√µes de integridade ao Modelo Relacional s√£o descritas em termos dos conceitos deste modelo.

### 1.1 Modelo Relacional com Restri√ß√µes de Integridade

1. Desenvolva um Modelo Relacional correspondente ao modelo Entidade-Associa√ß√£o;
2. Complemente a seu Modelo Relacional com um conjunto de Restri√ß√µes de Integridade que represente o modelo E-A apresentado com a maior fidelidade.

- Employee (<u>ssn</u>, employee_TIN, bdate, name)
    - UNIQUE(employee_TIN) NOT NULL
- Department (<u>name</u>)
- Workplace (<u>workplace_address</u>, lat, long)
    - UNIQUE(lat, long)
- Office (<u>workplace_address</u>)
    - workplace_address: FK (Workplace)
- Warehouse (<u>workplace_address</u>)
    - workplace_address: FK (Workplace)
- works (<u>ssn</u>, name, workplace_address)
    - ssn: FK(Empoloyee)
    - name: FK(Department) NOT NULL
    - workplace_address: FK(Worlplace) NOT NULL
- Customer (<u>customer_no</u>, name, email, phone, customer_address)
    - UNIQUE(email)
- Order (<u>order_no</u>, date, customer_no)
    - customer_no: FK(Customer) NOT NULL
- process (<u>ssn</u>, <u>order_no</u>)
    - ssn: FK(Employee)
    - order_no: FK(Order)
- Sale (<u>order_no</u>, cust_no)
    - order_no: FK(Order)
    - cust_no: FK(Customer) NOT NULL
- Product (<u>sku</u>, name, description, price)
- contains (<u>order_no</u>, <u>sku</u>, quantity)
    - order_no: FK(Order)
    - sku: FK(Product)
    - quantity NOT NULL
- Supplier (<u>supplier_TIN</u>, name, supplier_address)
- supply-contract(<u>supplier_TIN</u>, <u>sku</u>, date)
    - supplier_TIN: FK(Supplier)
    - sku: FK(Product) NOT NULL
- delivery (<u>workplace_address</u>, <u>sku</u>, <u>supplier_TIN</u>)
    - workplace_address: FK(Warehouse)
    - sku, supplier_TIN: FK(Supply-Contract)
- EAN Product (<u>sku</u>, ean)
    - sku: FK(Product)

### 1.2 Restri√ß√µes de Integridade n√£o pass√≠veis de convers√£o

Identifique todas as Restri√ß√µes de Integridade do modelo Entidade-Associa√ß√£o apresentado que n√£o s√£o pass√≠veis de convers√£o para o modelo relacional.

- RI-1: Todos os ssn de Employee t√™m de estar em works
- RI-2: Todos os order_no de Order t√™m de estar em contains
- RI-3: Todos os sku em Product t√™m de estar em supply-contract
- RI-4: Todos os supplier_TIN em Supplier t√™m de estar em supply-contract

## 2 Algebra Relacional

Recorde a nota√ß√£o exposta nas aulas te√≥ricas como se segue:

$\Pi_{atributo1} \big( \sigma_{atributo1=atributo2} (relacaoA \bowtie relacaoB) \big)$

#### Simbolos
- $\cup$ union 			
- $\cap$ intersection 		
- $-$ difference 		
- $\times$ cartesian product 
- $\div$ division 			
- $\rho$ rename 			
- $\bowtie$ natural join 		
- $\wedge$ Logical AND 	
- $\vee$ Logical OR 	
- $\neg$ Logical NOT 	

Considerando o modelo relacional desenvolvido, apresente as express√µes alg√©bricas correspondentes a cada uma das seguintes interroga√ß√µes:

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de pre√ßo superior a ‚Ç¨50 no ano de 2023;

$\Pi_{c.name} \big(((customer\bowtie \sigma_{year(date)=2023} (order)) \bowtie contains) \bowtie_{co.sku = p.sku} \sigma_{price > 50}(product) \big)$

2. Liste o nome de todos os empregados que trabalham em armaz√©ns e n√£o em escrit√≥rios e processaram encomendas em Janeiro de 2023;

$a ü°ê employee \bowtie_{e.ssn=w.ssn} works$  
$b ü°ê process \bowtie \sigma_{year(date)=2023 \wedge month(date)=01}(order)$  
$\Pi_{e.name} \big (((a) \bowtie warehouse) \bowtie (b)) - \Pi_{e.name}((a) \bowtie office \big)$

3. Indique o nome do produto mais vendido;

$s ü°ê (sales \bowtie contains)$  
$P ü°ê (_{sku} G_{sum(quantity)‚Üíc} (s))$  
$\Pi_{name} \big(product \bowtie P \bowtie G_{max(c)} (P) \big) $

4. Indique o valor total de cada venda realizada.

$u ü°ê (sales \bowtie contains\bowtie product)$  
$v ü°ê (\Pi_{order\_no, quantity*price‚Üíc} (u))$\
$t ü°ê (_{order\_no} G_{sum(c)} (v))$\
$\rho_{result(2 ü°ítotal‚ÄÉvalue‚ÄÉof‚ÄÉeach‚ÄÉsale)}‚ÄÉ(t)$

## 3 Tradu√ß√£o do Modelo Relacional para SQL

### 3.1 Esquema Relacional (schema.sql)

Crie uma base de dados SQL correspondente ao esquema Relacional desenvolvido no ponto anterior.
Utilizando a linguagem SQL (DDL), apresente as instru√ß√µes para criar o esquema de bases de dados correspondente ao modelo relacional desenvolvido. Deve certificar-se de que os tipos de dados e tamanhos de campo selecionados sejam os mais apropriados. As restri√ß√µes aplic√°veis a cada campo, linha e tabela tamb√©m devem ser especificadas recorrendo √†s instru√ß√µes NOT NULL, CHECK, PRIMARY KEY, UNIQUE e FOREIGN KEY conforme seja apropriado.


Nota: Apresente todas as restri√ß√µes existentes no modelo Relacional que n√£o podem ser capturadas (implementadas) no esquema SQL, escrevendo-as como coment√°rios na tabela respectiva.

In [1]:
%load_ext sql
%sql postgresql://db:db@postgres/db

In [2]:
%%sql
-- schema.sql

-- DROP TABLE ...
drop table if exists Employee cascade;
drop table if exists Department cascade;
drop table if exists Workplace cascade;
drop table if exists Office cascade;
drop table if exists Warehouse cascade;
drop table if exists works cascade;
drop table if exists Customer cascade;
drop table if exists Order_ cascade;
drop table if exists process cascade;
drop table if exists Sale cascade;
drop table if exists Product cascade;
drop table if exists contains cascade;
drop table if exists Supplier cascade;
drop table if exists supply_contract cascade;
drop table if exists delivery cascade;
drop table if exists EAN_Product cascade;

-- CREATE TABLE ...

create table Employee
(
    ssn numeric(12),
    employee_TIN numeric(9) not null unique,
    bdate date,
    employee_name varchar(80),
    PRIMARY KEY(ssn)
);

create table Department
(
    department_name varchar(30),
    PRIMARY KEY(department_name)
);


create table Workplace
(
    workplace_address varchar(80),
    lat_ decimal(8, 2),
    long_ numeric(9, 2),
    CONSTRAINT coords UNIQUE (lat_ , long_),
    PRIMARY KEY(workplace_address)
);

create table Office
(
    workplace_address varchar(80), 
    PRIMARY KEY(workplace_address),
    FOREIGN KEY(workplace_address) REFERENCES Workplace
);


create table Warehouse
(
    workplace_address varchar(80), 
    PRIMARY KEY(workplace_address),
    FOREIGN KEY(workplace_address) REFERENCES Workplace
);

create table works
(
    ssn numeric(12),
    department_name varchar(30) not null,
    workplace_address varchar(80) not null,
    PRIMARY KEY(ssn, department_name, workplace_address),
    FOREIGN KEY(ssn) REFERENCES Employee,
    FOREIGN KEY(department_name) REFERENCES Department,
    FOREIGN KEY(workplace_address) REFERENCES Workplace
);

create table Customer
(
    customer_no numeric(12),
    customer_name varchar(80),
    customer_email varchar(320) unique,
    customer_phone numeric(9),
    customer_address varchar(80),
    PRIMARY KEY(customer_no)
);

create table Order_
(
    order_no numeric(12),
    date_ date,
    customer_no numeric(12) not null,
    PRIMARY KEY(order_no),
    FOREIGN KEY(customer_no) REFERENCES Customer
    
);

create table process
(
    ssn numeric(12),
    order_no numeric(12),
    PRIMARY KEY(ssn, order_no),
    FOREIGN KEY(ssn) REFERENCES Employee,
    FOREIGN KEY(order_no) REFERENCES Order_
    
);

create table Sale
(
    order_no numeric(12),
    cust_no numeric(12) not null,
    PRIMARY KEY(order_no),
    FOREIGN KEY(order_no) REFERENCES Order_,
    FOREIGN KEY(cust_no) REFERENCES Customer  
    
);

create table Product
(
    sku numeric(12),
    product_name varchar(80),
    description varchar(320),
    price numeric(7,2),
    PRIMARY KEY(sku)
);

create table contains
(
    order_no numeric(12),
    sku numeric(12),
    quantity numeric(7) not null,
    PRIMARY KEY(order_no, sku),
    FOREIGN KEY(order_no) REFERENCES Order_,
    FOREIGN KEY(sku) REFERENCES Product
    
);

create table Supplier
(
    supplier_TIN numeric(9),
    supplier_name varchar(80),
    supplier_address varchar(80),
    PRIMARY KEY(supplier_TIN)
);

create table supply_contract
(
    supplier_TIN numeric(9),
    sku numeric(12), 
    contract_date date,
    PRIMARY KEY(supplier_TIN, sku), /*nao me parece bem*/
    FOREIGN KEY(supplier_TIN) REFERENCES Supplier,
    FOREIGN KEY(sku) REFERENCES Product
);

create table delivery
(
    workplace_address varchar(80),
    sku numeric(12),
    supplier_TIN numeric(9),
    PRIMARY KEY(workplace_address, sku, supplier_TIN),
    FOREIGN KEY(workplace_address) REFERENCES Warehouse,
    FOREIGN KEY(sku) REFERENCES Product,
    FOREIGN KEY(supplier_TIN) REFERENCES Supplier
    
    
);

create table EAN_Product
(
    sku numeric(12),
    ean numeric(13),
    PRIMARY KEY(sku),
    FOREIGN KEY(sku) REFERENCES Product
);

*  postgresql://db:***@postgres/db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

### 3.2 Carregamento da Base de Dados

Crie um script SQL (DML) com todas as instru√ß√µes INSERT necess√°rias para criar alguns dados de teste sint√©ticos para facilitar a valida√ß√£o dos resultados esperados das consultas (lembre-se de que cada tabela deve conter pelo menos uma linha e que todas as consulta t√™m de retornar um resultado n√£o vazio).

In [3]:
%%sql
-- populate.sql

/*
Customer - 0
Order - 1
Employee - 2
Product - 3
Supplier - 4
*/

-- INSERT ...
insert into Employee values (2222222221, 123456789, TO_DATE('01-04-2003', 'DD-MM-YYYY'),'Jo√£o Fidalgo');
insert into Employee values (2222222222, 123123123,TO_DATE('30-09-2003', 'DD-MM-YYYY'), 'Jos√© Lopes');
insert into Employee values (2222222223, 321321321,TO_DATE('08-08-2003', 'DD-MM-YYYY'), 'Rodrigo Fri√£es');
insert into Employee values (2222222224, 123412452,TO_DATE('25-12-1967', 'DD-MM-YYYY'), 'Manuel Serra');



insert into Department values ('Manufacturing');
insert into Department values ('Management');
insert into Department values ('Human resources');

insert into Workplace values ('Grand Rapids, MI 49512, USA', 12345.34, 31245.23);
insert into Workplace values ('Asteriastraat 1, 5047 Tilburg, Netherlands', 234111.4, 90767.76);
insert into Workplace values ('Av. Rovisco Pais, N¬∫ 1. 1049-001 Lisboa, Portugal', 65431.89, 53156.6);
insert into Office values ('Av. Rovisco Pais, N¬∫ 1. 1049-001 Lisboa, Portugal');
insert into Warehouse values ('Grand Rapids, MI 49512, USA');
insert into Warehouse values ('Asteriastraat 1, 5047 Tilburg, Netherlands');

insert into works values (2222222221, 'Management', 'Av. Rovisco Pais, N¬∫ 1. 1049-001 Lisboa, Portugal');
insert into works values (2222222222, 'Manufacturing', 'Grand Rapids, MI 49512, USA');
insert into works values (2222222223, 'Human resources', 'Grand Rapids, MI 49512, USA');
insert into works values (2222222223, 'Human resources', 'Av. Rovisco Pais, N¬∫ 1. 1049-001 Lisboa, Portugal');
insert into works values (2222222224, 'Manufacturing', 'Asteriastraat 1, 5047 Tilburg, Netherlands');



insert into Customer values (0000000001, 'Tom√°s Cruz', 'aaaa@gmail.com', 911111111, '1600 Pennsylvania Avenue, N.W., Washington DC, USA');
insert into Customer values (0000000002, 'Jo√£o Rocha', 'bbbb@gmail.com', 922222222, '1 Sheikh Mohammed bin Rashid Blvd');
insert into Customer values (0000000003, 'Madalena Correia', 'cccc@gmail.com', 933333333, '20 W 34th St., New York, NY 10001, EUA');

insert into Order_ values (111111111113, TO_DATE('31-12-2022', 'DD-MM-YYYY'), 0000000001);
insert into Order_ values (111111111112, TO_DATE('21-05-2023', 'DD-MM-YYYY'), 0000000002);
insert into Order_ values (111111111111, TO_DATE('22-05-2023', 'DD-MM-YYYY'), 0000000003);
insert into Order_ values (111111111114, TO_DATE('23-05-2023', 'DD-MM-YYYY'), 0000000003);
insert into Order_ values (111111111115, TO_DATE('11-01-2023', 'DD-MM-YYYY'), 0000000001);
insert into Order_ values (111111111116, TO_DATE('24-01-2023', 'DD-MM-YYYY'), 0000000002);
insert into Order_ values (111111111117, TO_DATE('10-01-2023', 'DD-MM-YYYY'), 0000000003);
insert into Order_ values (111111111118, TO_DATE('01-01-2023', 'DD-MM-YYYY'), 0000000002);




insert into process values (2222222221, 111111111111);
insert into process values (2222222221, 111111111112);
insert into process values (2222222222, 111111111113);
insert into process values (2222222222, 111111111114);
insert into process values (2222222221, 111111111115);
insert into process values (2222222222, 111111111116);
insert into process values (2222222223, 111111111117);
insert into process values (2222222224, 111111111118);




insert into Sale values (111111111113, 0000000001);
insert into Sale values (111111111112, 0000000002);
insert into Sale values (111111111111, 0000000003);
insert into Sale values (111111111114, 0000000003);

insert into Sale values (111111111115, 0000000001);
insert into Sale values (111111111117, 0000000003);



insert into Product values (333333333331,'JIMEI keyboard', 'Reliable and durable mechanical keyboard', 99.99);
insert into Product values (333333333332, 'JIMEI gaming chair', 'Comfortable and fully reclining chair', 359.99);
insert into Product values (333333333333, 'JIMEI mouse', '3 types of DPI, featuring side buttons for gaming', 49.99);

insert into contains values (111111111113, 333333333333, 3);
insert into contains values (111111111112, 333333333332, 2);
insert into contains values (111111111111, 333333333333, 1);
insert into contains values (111111111114, 333333333331, 1);
insert into contains values (111111111115, 333333333333, 1);
insert into contains values (111111111116, 333333333332, 2);
insert into contains values (111111111117, 333333333331, 5);
insert into contains values (111111111118, 333333333332, 1);


insert into Supplier values (444444441, 'Peripherals Warehouse', 'R Cortinhas Fonte 94, Porto, Portugal');
insert into Supplier values (444444442, 'Chairs and Desks', 'Rua Jorge Sena 90, Lisboa, Portugal');

insert into supply_contract values (444444441, 333333333331, TO_DATE('01-12-2022', 'DD-MM-YYYY'));
insert into supply_contract values (444444441, 333333333333, TO_DATE('08-12-2022', 'DD-MM-YYYY'));
insert into supply_contract values (444444442, 333333333332, TO_DATE('16-06-2021', 'DD-MM-YYYY'));
            
insert into delivery values ('Grand Rapids, MI 49512, USA', 333333333333, 444444441);
insert into delivery values ('Grand Rapids, MI 49512, USA', 333333333331, 444444441);
insert into delivery values ('Asteriastraat 1, 5047 Tilburg, Netherlands', 333333333332, 444444442);
                                
insert into EAN_Product values (333333333333, 1916921353653);
insert into EAN_Product values (333333333331, 7457982594561);

*  postgresql://db:***@postgres/db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## 4 Linguagem SQL

Apresente a express√£o SQL correspondente  a cada uma das interroga√ß√µes de √Ålgebra Relacional.

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de pre√ßo superior a ‚Ç¨50 no ano de 2023;

In [4]:
%%sql

-- SELECT ...
SELECT
    DISTINCT ct.customer_name
FROM
    Customer as ct,
    Order_ as o,
    contains as ctns,
    Product as p
WHERE
    ct.customer_no = o.customer_no
AND
    EXTRACT(YEAR FROM o.date_) = 2023 
AND
    o.order_no = ctns.order_no
AND
    ctns.sku = p.sku
AND
    p.price > 50

*  postgresql://db:***@postgres/db
2 rows affected.

[('Jo√£o Rocha',), ('Madalena Correia',)]

2. Liste o nome de todos os empregados que trabalham em armaz√©ns e n√£o em escrit√≥rios e processaram encomendas em Janeiro de 2023;

In [5]:
%%sql

-- SELECT ...
SELECT
    DISTINCT e.employee_name
FROM
    Employee as e,
    works as wk,
    Warehouse as wh,
    process as p,
    Order_ as o
WHERE
    e.ssn = wk.ssn
AND
    wk.workplace_address = wh.workplace_address
AND
    p.ssn = e.ssn
AND
    p.order_no = o.order_no
AND
    EXTRACT(YEAR FROM o.date_) = 2023
AND
    EXTRACT(MONTH FROM o.date_) = 01 
EXCEPT
    SELECT
        DISTINCT e.employee_name
    FROM
        Employee as e,
        works as wk,
        Office as of
    WHERE
        e.ssn = wk.ssn
    AND
        wk.workplace_address = of.workplace_address

*  postgresql://db:***@postgres/db
2 rows affected.

[('Jos√© Lopes',), ('Manuel Serra',)]

3. Indique o nome do produto mais vendido;

In [6]:
%%sql

-- SELECT ...
WITH sold_products AS (
        SELECT sku, SUM(quantity) AS sum_quantity 
        FROM contains INNER JOIN sale USING (order_no)
        GROUP BY sku),
    max_value AS (
        SELECT MAX(sum_quantity) as sum_quantity
        FROM sold_products)
 
SELECT DISTINCT product_name
FROM product INNER JOIN (sold_products INNER JOIN max_value USING (sum_quantity)) USING (sku)

*  postgresql://db:***@postgres/db
1 rows affected.

[('JIMEI keyboard',)]

4. Indique o valor total de cada venda realizada.

In [7]:
%%sql

-- SELECT ...
SELECT
    order_no as sale_no, SUM(quantity*price) as total_value
FROM (contains INNER JOIN sale USING (order_no)) INNER JOIN product USING (sku)
    GROUP BY order_no
    ORDER BY order_no

*  postgresql://db:***@postgres/db
6 rows affected.

[(Decimal('111111111111'), Decimal('49.99')),
 (Decimal('111111111112'), Decimal('719.98')),
 (Decimal('111111111113'), Decimal('149.97')),
 (Decimal('111111111114'), Decimal('99.99')),
 (Decimal('111111111115'), Decimal('49.99')),
 (Decimal('111111111117'), Decimal('499.95'))]